Revit 2024 API
CADLinkOptions Constructor
Overload List
Name | Description
CADLinkOptions(CADLinkOptions)
 Constructs a new copy of the input CADLinkOptions object.
CADLinkOptions(Boolean, ElementId)
 Creates a CADLinkOptions object, specifying whether to preserve graphic overrides, and what view to use if the link's view has been deleted.
See Also
CADLinkOptions Class
CADLinkOptions Members
Autodesk.Revit.DB Namespace